hydevcode/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_WIFI/packages/wifi-host-driver-latest/lwip-network-interface-integration/source/cy_lwip_dhcp_server.c
/*
 * Copyright 2025, Cypress Semiconductor Corporation (an Infineon company) or
 * an affiliate of Cypress Semiconductor Corporation.  All rights reserved.
 *
 * This software, including source code, documentation and related
 * materials ("Software") is owned by Cypress Semiconductor Corporation
 * or one of its affiliates ("Cypress") and is protected by and subject to
 * worldwide patent protection (United States and foreign),
 * United States copyright laws and international treaty provisions.
 * Therefore, you may use this Software only as provided in the license
 * agreement accompanying the software package from which you
 * obtained this Software ("EULA").
 * If no EULA applies, Cypress hereby grants you a personal, non-exclusive,
 * non-transferable license to copy, modify, and compile the Software
 * source code solely for use in connection with Cypress's
 * integrated circuit products.  Any reproduction, modification, translation,
 * compilation, or representation of this Software except as specified
 * above is prohibited without the express written permission of Cypress.
 *
 * Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND,
 * EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. Cypress
 * reserves the right to make changes to the Software without notice. Cypress
 * does not assume any liability arising out of the application or use of the
 * Software or any product or circuit described in the Software. Cypress does
 * not authorize its products for use in any products where a malfunction or
 * failure of the Cypress product may reasonably be expected to result in
 * significant property damage, injury or death ("High Risk Product"). By
 * including Cypress's product in a High Risk Product, the manufacturer
 * of such system or application assumes all risk of such use and in doing
 * so agrees to indemnify Cypress against all liability.
*/

/** @file
 *  Implementation of a simple DHCP server
 */

#include "lwip/err.h"
#include "lwip/api.h"
#include "lwip/netif.h"
#if !NO_SYS
#include "lwip/netifapi.h"
#else
#include "lwip/ip.h"
#endif

#if LWIP_NETCONN || LWIP_SOCKET

#if LWIP_IPV4

#include "cy_lwip_dhcp_server.h"
#include "cy_nw_mw_core_error.h"
#include "cyabs_rtos.h"
#include "cy_lwip_log.h"
#include <string.h>

/******************************************************
 *                      Macros
 ******************************************************/

#ifndef MIN
#define MIN(x,y)  ((x) < (y) ? (x) : (y))
#endif /* ifndef MIN */

#define MAKE_IPV4_ADDRESS(a, b, c, d)                 ((((uint32_t) d) << 24) | (((uint32_t) c) << 16) | (((uint32_t) b) << 8) |((uint32_t) a))
#define SET_IPV4_ADDRESS(addr_var, addr_val)          (((addr_var).version = CY_LWIP_IP_VER_V4),((addr_var).ip.v4 = (uint32_t)(addr_val)))
#define GET_IPV4_ADDRESS(addr_var)                    ((addr_var).ip.v4)
#define MEMCAT(destination, source, source_length)    (void*)((uint8_t*)memcpy((destination),(source),(source_length)) + (source_length))

/******************************************************
 *                    Constants
 ******************************************************/

#define ULONG_MAX_STR                           "4294967295"
#define ULONG_MIN_STR                           "0000000000"

#ifndef DHCP_IP_ADDRESS_CACHE_MAX
#define DHCP_IP_ADDRESS_CACHE_MAX               (5)
#endif

#define DHCP_SERVER_RECEIVE_TIMEOUT             (500)
#define ALLOCATE_PACKET_TIMEOUT                 (2000)

/* BOOTP operations */
#define BOOTP_OP_REQUEST                        (1)
#define BOOTP_OP_REPLY                          (2)

/* DHCP options */
#define DHCP_SUBNETMASK_OPTION_CODE             (1)
#define DHCP_MTU_OPTION_CODE                    (26)
#define DHCP_REQUESTED_IP_ADDRESS_OPTION_CODE   (50)
#define DHCP_LEASETIME_OPTION_CODE              (51)
#define DHCP_MESSAGETYPE_OPTION_CODE            (53)
#define DHCP_SERVER_IDENTIFIER_OPTION_CODE      (54)
#define DHCP_WPAD_OPTION_CODE                   (252)
#define DHCP_END_OPTION_CODE                    (255)

/* DHCP commands */
#define DHCPDISCOVER                            (1)
#define DHCPOFFER                               (2)
#define DHCPREQUEST                             (3)
#define DHCPDECLINE                             (4)
#define DHCPACK                                 (5)
#define DHCPNAK                                 (6)
#define DHCPRELEASE                             (7)
#define DHCPINFORM                              (8)
#define CY_LWIP_PAYLOAD_MTU                     (1500)
#define PHYSICAL_HEADER                         (44)

/* UDP port numbers for DHCP server and client */
#define IPPORT_DHCPS                            (67)
#define IPPORT_DHCPC                            (68)
#define WAIT_FOREVER                            ((uint32_t) 0xFFFFFFFF)
#define MAX_UDP_PAYLOAD_SIZE                    (CY_LWIP_PAYLOAD_MTU - UDP_HLEN - IP_HLEN - PHYSICAL_HEADER)
#define CY_DHCP_MAX_MUTEX_WAIT_TIME_MS          (120000)
#define WPAD_SAMPLE_URL                         "http://xxx.xxx.xxx.xxx/wpad.dat"

/******************************************************
 *               Variable Definitions
 ******************************************************/
static const uint8_t mtu_option_buff[]             = { DHCP_MTU_OPTION_CODE, 2, CY_LWIP_PAYLOAD_MTU>>8, CY_LWIP_PAYLOAD_MTU&0xff };
static const uint8_t dhcp_offer_option_buff[]      = { DHCP_MESSAGETYPE_OPTION_CODE, 1, DHCPOFFER };
static const uint8_t dhcp_ack_option_buff[]        = { DHCP_MESSAGETYPE_OPTION_CODE, 1, DHCPACK };
static const uint8_t dhcp_nak_option_buff[]        = { DHCP_MESSAGETYPE_OPTION_CODE, 1, DHCPNAK };
static const uint8_t lease_time_option_buff[]      = { DHCP_LEASETIME_OPTION_CODE, 4, 0x00, 0x01, 0x51, 0x80 }; /* 1-day lease */
static const uint8_t dhcp_magic_cookie[]           = { 0x63, 0x82, 0x53, 0x63 };
static const cy_lwip_mac_addr_t empty_cache        = { .octet = {0} };
typedef struct netbuf cy_lwip_packet_t;
static cy_mutex_t dhcp_mutex;

/******************************************************
 *                   Enumerations
 ******************************************************/

/******************************************************
 *                 Type Definitions
 ******************************************************/

/******************************************************
 *                    Structures
 ******************************************************/

